load-test/campaigns/2026-08-02_post-removal-regression/scenarios/place-list-popular-120.yml
# 인기순 장소 조회 부하 시나리오 (2026-07-30 재작성)
#
# RPS 산정 근거 (설계 문서 §1.1):
#   일일 총 요청 = DAU 20,000 × 세션 1.5회/일 × 세션당 8호출 = 240,000
#   평균 RPS     = 240,000 / 86,400 = 2.8
#   예상 피크    = 2.8 × 8 (여가 앱 저녁·주말 집중) = 22 req/s
#   목표 120 req/s = 예상 피크의 5.5배 = DAU 약 11만까지 감당하는 헤드룸
#   → 결과는 "지금 충분한가"가 아니라 "언제까지 충분한가"로 읽는다.
#
# 부하는 항상 LB(8082)로 보낸다. 개별 인스턴스는 포트를 노출하지 않는다.
# phases는 단독 정의한다 — Artillery `environments`는 phase 배열을 원소 단위로
# 병합해 기본 프로파일이 잔존하는 버그가 있다 (#381 측정 실패 원인).
config:
  target: "http://localhost:8082"
  payload:
    path: "../../../data/users.csv"  # campaigns/<캠페인>/scenarios/ 기준 (실제 파일: load-test/data/users.csv)
    fields:
      - token
    order: random
    skipHeader: true
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 20
    - name: "Ramp up"
      duration: 30
      arrivalRate: 30
      rampTo: 120
    - name: "Sustained load"
      duration: 120
      arrivalRate: 120
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # 동네 단위 인기순 첫 페이지 — 서울 leaf(301~318) 편중을 그대로 반영
  - name: "popular-town"
    weight: 40
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (popular town)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 시 단위 (서울 전체 = leaf 18개 합집합) — 정렬 대상 상한 1,800개 경로
  - name: "popular-city"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (popular city)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 태그 필터 조합
  - name: "popular-tag-filter"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: "{{ $randomNumber(1, 6) }}"
            size: 20
          name: "GET /api/places (popular tag)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 무한 스크롤: 1페이지 → nextCursor로 2페이지
  # 다중 인스턴스에서 두 요청이 다른 인스턴스로 갈 수 있다 — 커서 정합성 검증 경로
  - name: "popular-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (scroll p1)"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "nextCursor"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
            cursor: "{{ nextCursor }}"
          name: "GET /api/places (scroll p2)"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "nextCursor"