load-test/campaigns/2026-08-02_post-removal-regression/scenarios/place-list-popular-360.yml
# 한계 부하 탐색 360 req/s (측정 3) — 혼합 믹스: 조회 90% (baseline 내부 비율 유지) + 북마크 토글 10%
# 검증 대상: 증분 UPDATE(쓰기)와 인기순 SELECT(place_stats 조인)가 같은 테이블에서 만나는 상황.
# 북마크 토글의 4xx(이미 북마크됨/대상 없음/비활성 장소)는 도메인 충돌로 별도 집계 — 5xx만 실패.
# phases는 단독 정의한다 — Artillery `environments`는 phase 배열을 원소 단위로
# 병합해 기본 프로파일이 잔존하는 버그가 있다 (#381 측정 실패 원인).
config:
  target: "http://localhost:8082"
  processor: "./limit-processor.js"
  payload:
    # campaigns/<캠페인>/scenarios/ 기준 (실제 파일: load-test/data/users.csv)
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 20
    - name: "Ramp up"
      duration: 30
      arrivalRate: 30
      rampTo: 360
    - name: "Sustained load"
      duration: 120
      arrivalRate: 360
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # 동네 단위 인기순 첫 페이지 — 서울 leaf(301~318) 편중을 그대로 반영
  - name: "popular-town"
    weight: 36
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (popular town)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 시 단위 (서울 전체 = leaf 18개 합집합) — 정렬 대상 상한 1,800개 경로
  - name: "popular-city"
    weight: 18
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (popular city)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 태그 필터 조합
  - name: "popular-tag-filter"
    weight: 18
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: "{{ $randomNumber(1, 6) }}"
            size: 20
          name: "GET /api/places (popular tag)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 무한 스크롤: 1페이지 → nextCursor로 2페이지
  # 다중 인스턴스에서 두 요청이 다른 인스턴스로 갈 수 있다 — 커서 정합성 검증 경로
  - name: "popular-scroll"
    weight: 18
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (scroll p1)"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "nextCursor"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
            cursor: "{{ nextCursor }}"
          name: "GET /api/places (scroll p2)"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "nextCursor"

  # 북마크 토글 (등록 → 즉시 취소, 같은 placeId) — 쓰기 경로가 AFTER_COMMIT 증분을 발화시켜
  # place_stats UPDATE와 인기순 SELECT가 동시에 흐른다. 성공 경로는 시드에 넷 제로.
  # POST가 4xx(시드에 이미 있던 북마크)면 이어지는 DELETE가 그 시드 북마크를 지운다 —
  # 원본·통계 동시 반영이라 정합성은 유지되고 시드만 소폭 변형된다 (측정 1 이후 실행 필수)
  - name: "bookmark-toggle"
    weight: 10
    flow:
      - function: "pickPlace"
      - post:
          url: "/api/places/{{ placeId }}/bookmarks"
          name: "POST /api/places/:id/bookmarks"
          headers:
            Authorization: "Bearer {{ token }}"
      - delete:
          url: "/api/places/{{ placeId }}/bookmarks"
          name: "DELETE /api/places/:id/bookmarks"
          headers:
            Authorization: "Bearer {{ token }}"